[
    {
        "id": 1,
        "date":"June 9",
        "location":"Los Angeles, USA",
        "title": "Keighley’s Summer Game Fest",
        "image": "https://i.ibb.co/z7yytc5/summer.jpg",
        "price": 199,
        "description": "Launched in 2020, Geoff Keighley’s Summer Game Fest is a relatively new gaming event, offering gamers a glimpse into things to come from the industry. With E3 now canceled as many times as it has been—some ask whether it's time E3 was canceled for good even though we've had some iconic E3 moments—this event has been gaining steam.Over the last few years, the event has seen some big reveals, such as a game play trailer for Elden Ring. This year’s Summer Game Fest will be held at the YouTube Theater in California and feature big names in the industry.You can watch the event live on YouTube, Twitch, Steam, and several other platforms. There’s not much on what to expect, but there have been some hints trickling down from the event’s official Twitter page, such as the premiere of Mortal Kombat 1 game play."
    },
    {
        "id": 2,
        "date":"June 11",
        "location":"Los Angeles, USA",
        "title": "Microsoft’s Xbox Games Showcase",
        "image": "https://i.ibb.co/5511Npn/xbox.jpg",
        "price": 129,
        "description": "Another event that’s being live-streamed, the Xbox Games Showcase is sure to cover a range of interesting things for game-focused fans. Last year’s showcase event brought with it Starfield game play in addition to a ton of game-related news. While not much has been revealed on what to expect from this year’s Xbox Games Showcase, Microsoft has said that fans can expect some “first-looks” from the company’s internal studios. And, if you’re excited about Starfield, there’s going to be a lot more about the game revealed, with Microsoft confirming that Starfield Direct, a post-Xbox Games Showcase event, will have new game play as well as “behind-the-scenes insider information.” You can watch it live on various platforms, including Xbox’s YouTube and Twitch channels."
    },
    {
        "id": 3,
        "date":"June 12",
        "location":"Los Angeles, USA",
        "title": "Ubisoft Forward Live",
        "image": "https://i.ibb.co/1rxZ149/ubisoft.jpg",
        "price": 139,
        "description": "Ubisoft pulled out of E3 shortly before the June video game event was canceled, but even on its own, the gaming giant should have enough to whet gamers’ appetites. At 2022’s Ubisoft Forward event, which was held in September, the company showcased some Skull and Bones game play, unveiled Assassin’s Creed Mirage, and revealed a new season of The Division 2, among a host of other announcements. So this year’s Ubisoft Forward is bound to be interesting. Maybe we’ll find out more about the Assassin’s Creed title that takes players to feudal Japan."
    },
    {
        "id": 4,
        "date":"June 27 to 29",
        "location":"San Francisco, USA",
        "title": "GDC Showcase",
        "image": "https://i.ibb.co/rbb5pVh/gdc.jpg",
        "price": 149,
        "description": "The Game Developers Conference (GDC) is held in March every year, but the GDC Showcase is a digital-only event being held in June to allow video game developers to connect and share ideas. We may not see too many reveals and announcements at this event, since it’s geared mainly for developers, but it is possible that gaming audiences will get something out of it.This year’s event will have talks, Q&A sessions, and developers breaking down their games, analyzing the style, art, music, and much more that it takes to make successful video games."
    },
    {
        "id": 5,
        "date":"June 28 to July 2",
        "location":"Sao Paolo, Brazil",
        "title": "Best International Game Festival",
        "image": "https://i.ibb.co/SJw1vyT/big.png",
        "price": 178,
        "description": "The Best International Games Festival (BIG Festival) has been held since 2012. This year there’ll be hands-on events where attendees can play games by big-name publishers from all over the world. Game developers will be interacting with the audience, so there’s bound to be something interesting to come out of it. This year, expect workshops, keynote speeches and more from the festival."
    },
    {
        "id": 6,
        "date":"July 14 to 16",
        "location":"Kyoto, Japan",
        "title": "BitSummit Let’s Go!!",
        "image": "https://i.ibb.co/PWXSCQZ/bitsummit.jpg",
        "price": 180,
        "description": "The 2023 edition of BitSummit is titled BitSummit Let’s Go!! and it’s open to the public. To be held over three days in Kyoto, Japan, the show will host publishers from outside the country thanks to relaxed travel restrictions. Video game fans will also be able to participate online via the BitSummit Discord channel. And, the event will be made available for viewing online via BitSummit’s YouTube, Twitch, and TikTok channels. Expect there to be game reveals, although there’s nothing definitive about what we might see at the event."
    }
]